app/views/post/edit.html.erb

SELECT "selects".* FROM "selects"
---
                <textarea name="title" id="" cols="30" rows="1" placeholder = "Title"><%=@post.title%></textarea>
                <p>今までのカテゴリ&nbsp;:<%= @post.select%></p>