app/controllers/post_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
SELECT "selects".* FROM "selects"
SELECT "selects".* FROM "selects" WHERE "selects"."userid" = ?  [["userid", 3]]
SELECT "posts".* FROM "posts" ORDER BY "posts"."created_at" DESC
SELECT "posts".* FROM "posts" WHERE "posts"."user_id" = ? ORDER BY "posts"."created_at" DESC  [["user_id", 6]]
---
  def index
    @current_user = User.find_by(id: session[:user_id])
    if @current_user
      @options = Select.all
      @options = @options.where(userid: @current_user.id)
      @posts = Post.all.order(created_at: :desc)
      @posts = @posts.where(user_id: @current_user.id)

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 12], ["LIMIT", 1]]
INSERT INTO "selects" ("genre", "created_at", "updated_at") VALUES (?, ?, ?)  [["genre", "こっちは？"], ["created_at", "2019-10-06 20:00:59.482695"], ["updated_at", "2019-10-06 20:00:59.482695"]]
INSERT INTO "posts" ("title", "select", "url", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["title", "yuli"], ["select", "Joker"], ["url", "omg"], ["user_id", 12], ["created_at", "2019-10-07 12:34:27.901075"], ["updated_at", "2019-10-07 12:34:27.901075"]]
---
  def create
    @current_user = User.find_by(id: session[:user_id])
    @post=Post.new(id:params[:id],title: params[:title], url: params[:url], select: params[:select], user_id: @current_user.id)
    @post.save

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 12], ["LIMIT", 1]]
INSERT INTO "selects" ("genre", "created_at", "updated_at", "userid") VALUES (?, ?, ?, ?)  [["genre", "RADWIMPS"], ["created_at", "2019-10-07 11:24:53.570190"], ["updated_at", "2019-10-07 11:24:53.570190"], ["userid", 12]]
---
  def option_create
    @current_user = User.find_by(id: session[:user_id])
    @select = Select.new(genre:params[:genre],userid:@current_user.id)
    @select.save

SELECT "selects".* FROM "selects"
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 12], ["LIMIT", 1]]
SELECT "selects".* FROM "selects" WHERE "selects"."userid" = ?  [["userid", 12]]
SELECT  "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT ?  [["id", 17], ["LIMIT", 1]]
---
  def edit
    @options = Select.all
    @current_user = User.find_by(id: session[:user_id])
    @options = @options.where(userid: @current_user.id)
    @post = Post.find_by(id:params[:id])

SELECT  "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT ?  [["id", 7], ["LIMIT", 1]]
DELETE FROM "posts" WHERE "posts"."id" = ?  [["id", 6]]
---
  def destroy
    begin
      @post = Post.find_by(id: params[:id])
      @post.destroy

SELECT  "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT ?  [["id", 17], ["LIMIT", 1]]
SELECT  "selects".* FROM "selects" WHERE "selects"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
UPDATE "posts" SET "select" = ?, "updated_at" = ? WHERE "posts"."id" = ?  [["select", "disney"], ["updated_at", "2019-10-07 12:35:23.981829"], ["id", 17]]
---
  def update
    @post = Post.find_by(id: params[:id])
    @post.title= params[:title]
    @post.select=params[:select]
    @post.url= params[:url]
    if @post.save

SELECT "selects".* FROM "selects"
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 6], ["LIMIT", 1]]
SELECT "selects".* FROM "selects" WHERE "selects"."userid" = ?  [["userid", 12]]
SELECT  "selects".* FROM "selects" WHERE "selects"."id" = ? LIMIT ?  [["id", 6], ["LIMIT", 1]]
SELECT "posts".* FROM "posts" WHERE "posts"."select" = ? ORDER BY "posts"."created_at" DESC  [["select", "こっちは？"]]
SELECT "posts".* FROM "posts" WHERE "posts"."select" = ? AND "posts"."user_id" = ? ORDER BY "posts"."created_at" DESC  [["select", "こっちは？"], ["user_id", 3]]
---
  def each_option
    @options = Select.all
    @current_user = User.find_by(id: session[:user_id])
    @options = @options.where(userid: @current_user.id)
    @option = Select.find_by(id:params[:id])
    @posts = Post.all.order(created_at: :desc)
    @posts = @posts.where(select: @option.genre)
    @posts = @posts.where(user_id: @current_user.id)

SELECT "selects".* FROM "selects"
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 12], ["LIMIT", 1]]
SELECT "selects".* FROM "selects" WHERE "selects"."userid" = ?  [["userid", 12]]
SELECT "posts".* FROM "posts" WHERE "posts"."select" = ? ORDER BY "posts"."created_at" DESC  [["select", "とっておきたいページ"]]
SELECT "posts".* FROM "posts" WHERE "posts"."select" = ? AND "posts"."user_id" = ? ORDER BY "posts"."created_at" DESC  [["select", "とっておきたいページ"], ["user_id", 6]]
---
  def save
    @options = Select.all
    @current_user = User.find_by(id: session[:user_id])
    @options = @options.where(userid: @current_user.id)
    @posts = Post.all.order(created_at: :desc)
    @posts = @posts.where(select: "とっておきたいページ")
    @posts = @posts.where(user_id: @current_user.id)

SELECT "selects".* FROM "selects"
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 12], ["LIMIT", 1]]
SELECT "selects".* FROM "selects" WHERE "selects"."userid" = ?  [["userid", 12]]
SELECT "posts".* FROM "posts" WHERE "posts"."select" = ? ORDER BY "posts"."created_at" DESC  [["select", "よく見るページ"]]
SELECT "posts".* FROM "posts" WHERE "posts"."select" = ? AND "posts"."user_id" = ? ORDER BY "posts"."created_at" DESC  [["select", "よく見るページ"], ["user_id", 6]]
---
  def often
    @options = Select.all
    @current_user = User.find_by(id: session[:user_id])
    @options = @options.where(userid: @current_user.id)
    @posts = Post.all.order(created_at: :desc)
    @posts = @posts.where(select: "よく見るページ")
    @posts = @posts.where(user_id: @current_user.id)

SELECT  "selects".* FROM "selects" WHERE "selects"."id" = ? LIMIT ?  [["id", 6], ["LIMIT", 1]]
DELETE FROM "selects" WHERE "selects"."id" = ?  [["id", 6]]
---
  def destroyoption
    begin
      @option = Select.find_by(id: params[:id])
      @option.destroy