app/controllers/user_controller.rb

    def create
        @user=User.new(username: params[:username], password: params[:password])
        @user.save
---
INSERT INTO "users" ("username", "password", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["username", "yulikamiya"], ["password", "pinoko"], ["created_at", "2019-10-06 20:16:45.650504"], ["updated_at", "2019-10-06 20:16:45.650504"]]

    def login
        @user = User.find_by(username: params[:username], password: params[:password])
---
SELECT  "users".* FROM "users" WHERE "users"."username" = ? AND "users"."password" = ? LIMIT ?  [["username", "yulikamiya"], ["password", "pinoko"], ["LIMIT", 1]]